//#pragma once
//
//Memory Management :
//	Discuss the importance of memory management in C++ and explain the difference between stack and heap memory allocation.
//
//	Управлението на паметта в C++ позволява директно манипулиране на паметта чрез пойнтъри и освобождаване на памет 
//	с помощта на оператори като "new" и "delete". 
//	Правилното управление на паметта предотвратява изтичане на памет и избягва недефинирано поведение.
//
//	Стек памет :
//	Паметта на стека се използва за съхраняване на локални променливи и информация за функции.
//	Разпределението и освобождаването на памет в стека се извършва автоматично от компилатора.
//
//	Хийп памет :
//	Динамичната памет се използва за динамично разпределение на паметта.
//	Разпределението и освобождаването на паметта в хийп - а се управляват от програмиста, използвайки оператори "new" и "delete".
