//#pragma once
//
//Кино:
//Име
//адрес
//Списък със зали
//
//Зала :
//Име
//Брой места
//Списък с прожекции
//
//Прожекция :
//Име на филм
//Брой продадени билети
//
//
//Да се направят класовете описващи киното.
//В Кино да се реализират методи за :
//Добавяне на зала към списъка
//Търсене на прожекции за даден филм, по име на филма
//Коя прожекция е най - гледана в цялото кино(всички зали)
//Кой филм е бил най - гледан - трябва да се обходят всички прожекции за всеки филм и да се сумират постъпленията
//Коя зала е най - посещавана
//
//
//В Зала да има методи за :
//Добавяне на прожекция към списъка