#pragma once

//2. В клас `Shapes` добавете нова статична функция `drawPentagon`, 
//която рисува правилен петоъгълник по координати на централната точка и дължина на страната в пиксели;

//3. В клас `Shapes` добавете нова статична функция `drawHexagon`, 
//която рисува правилен шестоъгълник по координати на централната точка и дължина на страната в пиксели;

//4. * (БОНУС ЗАДАЧА) * В клас `Shapes` добавете нова статична функция, която рисува фигура по ваше желание* 
//(различна от правоъгълник, окръжност, петоъгълник, шестоъгълник)*;

//6. Напишете функция която рисува празен правоъгълник с подадена дебелина на линиите. 
//* (ПОЯСНЕНИЕ: може да стане с помощта 2 запълнени правоъгълника)*;

//10. * (БОНУС БОНУС ЗАДАЧА) * В клас `Shapes` добавете нова статична функция `drawEllipse`, която рисува елипса;